Repository: OpenChain-Project/Reference-Material
Catalog: Training-Slides/Official/1.0/ko/Translation-Tools/Curriculum-Translation-KR-level2.tmx
Source language: en_us
Languages: ko

source: Enforcing periodic audits
ko: 정기적인 검사 시행

source: Engineer
ko: 엔지니어

source: Engineering Specialists working with business interests, commercial licensing, export compliance, etc., who may be impacted by FOSS usage
ko: 사업적 이해관계, 상용 라이선싱, 수출 컴플라이언스 등 관련 일을 하면서 FOSS 사용으로 영향받을 수 있는 엔지니어링 전문가

source: Engineering or developer teams may participate in gathering relevant information
ko: 엔지니어링 팀 또는 개발자 팀이 관련 정보 수집에 참여할 수 있습니다.

source: Engineering staff on the
ko: 이러한 유형의 실패는 회사의 FOSS 정책 및 프로세스에 대하여 엔지니어링 직원에게 교육을 제공함으로 방지할 수 있다.

source: Ensure Compliance Prior to Product Shipment
ko: 제품 출하 전 컴플라이언스 보장

source: Ensure adequate compliance staffing and designate clear lines of responsibility
ko: 적절한 컴플라이언스 인력을 확보하고 명확한 책임 사항을 지정.

source: Ensure that each new version of the same FOSS component is reviewed and approved
ko: 동일한 FOSS 컴포넌트의 새로운 버전이 모두 검토되고 승인되었는지 확인한다.

source: Ensure the software in the audit report conforms with FOSS policies
ko: 검사 보고서 내의 소프트웨어가 FOSS 정책을 준수하도록 한다.

source: Ensure you have the notices and source code as needed to meet these obligations.
ko: 이러한 의무를 충족하기 위해 필요한 고지문과 소스 코드가 있는지 확인합니다.

source: Ensuring that auditing is a milestone in the iterative development process
ko: 반복적인 개발 프로세스 검사가 하나의 중요한 단계가 되도록 보장

source: Establishing Community Relationships
ko: 커뮤니티와의 관계 수립

source: Evaluate your obligations for all of the software that will be included in your products
ko: 귀사의 제품에 포함될 모든 소프트웨어에 관한 귀사의 모든 의무를 평가한다.

source: Example Enterprise Process
ko: 예: 기업 프로세스

source: Example Small to Medium Company Checklist
ko: 예: 중소 기업 체크리스트

source: Example of Compliance Management End-to- End Process
ko: 예 : 컴플라이언스 관리 전과정 프로세스

source: Example of Compliance Management End-to-End Process
ko: 예 : 컴플라이언스 관리 전과정 프로세스

source: Example of license reciprocity from the GPL version 2.0:
ko: GPL-2.0의 라이선스 상호주의 예:

source: Example:
ko: 예:

source: Example: BSD-3-Clause
ko: 예: BSD-3-Clause

source: Examples include:
ko: 예:

source: Examples of copyleft-style licenses include GPL and LGPL.
ko: Copyleft 스타일의 라이선스 예로는 GPL 및 LGPL이 있습니다.

source: Examples of permissive FOSS licenses include MIT, BSD, and Apache.
ko: Permissive FOSS 라이선스의 예로는 MIT, BSD 및 Apache가 있습니다.

source: Examples of works of authorship include photographs, songs, and computer code.
ko: 저작물의 예로는 사진, 노래 및 컴퓨터 코드가 있습니다.

source: Exclusive or non-exclusive terms
ko: 독점적 또는 비독점적인 조건

source: Executive Review Committee
ko: 경영진 리뷰 위원회

source: FOSS + Mods
ko: FOSS + 수정

source: FOSS Compliance Goals
ko: FOSS 컴플라이언스 목적

source: FOSS Compliance Issues: Distribution
ko: FOSS 컴플라이언스 쟁점: 배포

source: FOSS Compliance Issues: Modification
ko: FOSS 컴플라이언스 쟁점: 수정

source: FOSS Compliance Program
ko: FOSS 컴플라이언스 프로그램

source: FOSS Licenses
ko: FOSS 라이선스

source: FOSS Notices may include information about the identity of the copyright holders and the license governing the software.
ko: FOSS 고지에는 저작권 소유자의 신원 및 소프트웨어를 관리하는 라이선스에 대한 정보가 포함될 수 있습니다.

source: FOSS Notices may provide notice about modifications.
ko: FOSS 고지는 수정에 대한 고지를 제공할 수 있습니다.

source: FOSS Policy
ko: FOSS 정책

source: FOSS Review
ko: FOSS 리뷰

source: FOSS Review Oversight
ko: FOSS 리뷰 감독

source: FOSS Review Team
ko: FOSS 리뷰 팀

source: FOSS Training Reference Slides for the OpenChain Specification 1.1
ko: OpenChain 설명서 1.1을 위한 FOSS 교육 참조 슬라이드

source: FOSS Training Reference Slides for the OpenChain Specification 1.2
ko: OpenChain 설명서 1.2을 위한 FOSS 교육 참조 슬라이드

source: FOSS by definition cannot limit the field of use of the software
ko: FOSS의 정의상 소프트웨어의 사용분야를 제한할 수 없다.

source: FOSS compliance means following the licensing terms of FOSS licenses.
ko: FOSS 컴플라이언스는 FOSS 라이선스의 라이선스 조항을 준수한다는 의미입니다.

source: FOSS developers often use the term “proprietary” to describe a commercial non-FOSS license, even though both FOSS and proprietary licenses are based on intellectual property and provide a license grant to that property
ko: FOSS라이선스 및 독점 라이선스가 모두 지적 재산을 기반으로 하고 해당 자산에 대한 라이선스를 부여함에도, FOSS개발자들은 상업적 비 FOSS 라이선스를 설명하기 위해 종종 "독점"이라는 용어를 사용한다.

source: FOSS identified;
ko: FOSS 식별

source: FOSS licenses are Free and FOSS Software licenses generally make source code available under terms that allow for modification and redistribution.
ko: FOSS 라이선스는 "Free"이고 FOSS 소프트웨어 라이선스는 일반적으로 수정 및 재배포가 허용되는 조건 하에 소스 코드를 제공합니다.

source: FOSS licenses by definition make source code available under terms that allow for modification and redistribution
ko: FOSS 라이선스의 정의는 수정 및 재배포를 허용하는 조건하에서 소스 코드를 사용할 수 있게 하는 것이다.

source: FOSS licenses may also require the placement of notices in or alongside source code or documentation to give credit to the author (an attribution) or to make it clear the software includes modifications.
ko: FOSS 라이선스는 또한 저작자에게 크레딧을 주거나 소프트웨어가 수정 내용을 포함함을 명백히 하기 위하여 고지문구를 소스코드 안에 또는 소스코드와 병행하여 위치시킬 것을 요구할 수 있다.

source: FOSS licenses may have conditions related to providing attributions, copyright statement preservation, or a written offer to make the source code available
ko: FOSS 라이선스는 저작자 고지, 저작권 표시 보존 또는 소스 코드 제공 서면 청약과 관련된 조건을 가질 수 있다.

source: FOSS source code
ko: FOSS 소스 코드

source: FOSS training
ko: FOSS 교육의 실패

source: Facilitate effective usage of FOSS in their products (commercial or otherwise)
ko: 제품(상업적 또는 그외)내에서 효과적인 FOSS 사용을 가능하게 하고

source: Failure by developers to seek approval
ko: 개발자의 FOSS 사용 승인 신청 실패

source: Failure by developers to seek approval to use FOSS
ko: 개발자의 FOSS 사용 승인 신청 실패

source: Failure to Provide Accompanying Source Code for FOSS Component Modifications
ko: FOSS 컴포넌트 수정에 대한 동반하는 소스 코드 제공 실패

source: Failure to Provide Accompanying Source Code/appropriate license, attribution or notice information
ko: 동반하는 소스 코드 / 적절한 라이선스, 저작자 또는 고지 정보의 제공 실패

source: Failure to audit
ko: 소스 코드 검사 실패

source: Failure to audit the source code
ko: 소스 코드 검사 실패

source: Failure to mark FOSS
ko: FOSS 소스 코드 수정 표시 실패:

source: Failure to mark FOSS Source Code Modifications:
ko: FOSS 소스 코드 수정 표시 실패:

source: Failure to mark FOSS source code that has been changed as required by the FOSS license (or providing information about modifications which has an insufficient level of detail or clarity to satisfy the license)
ko: FOSS 라이선스가 요구하는 대로 FOSS 소스 코드의 변경 사항을 표시하는 것의 실패 (또는 자세함과 명확성에 있어서 라이선스를 만족시키기에 불충분한 수준의 수정에 대한 정보 제공)

source: Failure to resolve
ko: 검사상 발견사항의 해결 실패

source: Failure to resolve the audit findings (analyzing the "hits" reported by a scan tool or audit)
ko: 검사상 발견사항의 해결 실패 (스캔 도구 또는 검사에 의해 보고된 "발견(hits)"에 대한 분석)

source: Failure to seek review of FOSS in a timely manner
ko: FOSS 리뷰의 적시 요구 실패

source: Failure to take the FOSS training
ko: FOSS 교육의 실패

source: Final Verifications
ko: 최종 검증

source: First product release that will include the package
ko: 패키지를 포함하는 첫번째 제품 출시

source: First, you may need to follow up with the vendor if FOSS issues arise in the future, and having a reliable point of contact is important. You may also need to meet FOSS license obligations for FOSS delivered from the vendor.
ko: 첫째, 미래에 FOSS 문제가 발생할 경우 공급 업체와 후속 조치를 취해야 할 수 있있으며, 신뢰할 수 있는 연락처를 갖고 있는 것은 중요합니다. 또한 공급 업체가 제공한 FOSS에 대한 FOSS 라이선스 의무를 준수해야 할 수도 있습니다.

source: Fixing
ko: 해결 (Fixing)

source: Fixing, optimizing or making changes to the FOSS component
ko: FOSS 컴포넌트의 수정, 최적화 또는 변경

source: Follow the developer guidelines for using FOSS software, particularly incorporating or linking FOSS code into proprietary or third party source code or vice versa
ko: FOSS 소프트웨어 사용에 대한, 특히, FOSS 코드를 독점 소스 코드 또는 제3자 소스 코드에 통합하거나 링킹하는 경우 등에 대한 개발자 가이드라인을 따른다.

source: For example, a tool may inject portions of its own code into output of the tool.
ko: 예를 들어, 어떤 도구는 그 출력물에 자체 코드의 일부를 주입할 수 있다.

source: For example, an engineering team making modifications to a FOSS component may include proprietary code in the modifications.
ko: 예를 들어, FOSS 컴포넌트를 수정하는 엔지니어링팀이 수정 사항에 독점 코드를 포함시킬 수 있습니다.

source: For example, an open source software can be dual-licensed under MIT and GPLv2.
ko: 예를들어, 한 오픈 소스 소프트웨어가 MIT와 GPL-2.0의 듀얼 라이선스일 수 있습니다.

source: For example, how are FOSS and company components linked together?
ko: 예를 들어, FOSS와 회사 컴포넌트는 어떻게 서로 연결되어 있습니까?

source: For example, source code for released binaries should be captured and stored along with the binary version.
ko: 예를 들어, 출시된 바이너리의 소스 코드는 캡쳐되어 바이너리 버전과 함께 저장되야 합니다.

source: For example, the earlier steps may have identified a FOSS component that contains other FOSS code under an incompatible license.
ko: 예를 들어, 이전 단계에서 호환되지 않는 라이선스 하의 다른 FOSS 코드가 포함된 FOSS 컴포넌트를 식별했을 수 있습니다.

source: For example, code scanning may be used to locate undisclosed FOSS usage.
ko: 예를 들어, 코드 스캐닝은 공개되지 않은 FOSS의 사용을 찾기 위해 사용될 수 있습니다.

source: For more on dual-licensing as a business model: http://oss-watch.ac.uk/resources/duallicence2
ko: 비즈니스 모델로서 듀얼 라이선싱에 대한 자세한 내용은 다음 웹사이트를 참조하십시오: http://oss-watch.ac.uk/resources/duallicence2

source: For our example process, the steps include:
ko: 예제 프로세스에서는 다음 단계가 포함됩니다.

source: For some FOSS licenses, access via a computer network can be a “trigger” event
ko: 어떤 FOSS 라이선스에 대해서는 컴퓨터 네트워크를 통한 접근이 “의무발생”사유가 될 수 있다.

source: For some licenses, you may also need to include a full copy of the license text.
ko: 일부 라이선스의 경우, 라이선스 텍스트의 전체 사본을 포함해야 할 수도 있습니다.

source: Fostering relationships with the FOSS community and FOSS organizations
ko: FOSS 커뮤니티 및 FOSS 조직과의 관계 강화

source: Freeware and Shareware are not FOSS.The reason is that even though freeware and shareware are available without cost, they don't allow the users to make modifications to the software.In fact, many of the freeware and shareware contain similar license restrictions common in proprietary software.
ko: 프리웨어와 쉐어웨어는 FOSS가 아닙니다. 왜냐하면 프리웨어와 쉐어웨어는 비용 없이 사용할 수는 있지만, 사용자가 소프트웨어를 수정할 수 없도록 합니다. 사실 많은 프리웨어 및 쉐어웨어는 독점 소프트웨어와 유사한 라이선스 제한 사항이 포함되어 있습니다.

source: Freeware or Shareware licensing should not be regarded as the same or compatible with FOSS licensing.
ko: 프리웨어 또는 쉐어웨어 라이선스는 FOSS 라이선스와 동일하거나 호환되는 것으로 간주되어서는 안됩니다.

source: Freeware software is usually fully functional (no locked features) and available for unlimited use (no locking on days of usage)
ko: 프리웨어 소프트웨어는 일반적으로 완벽하게 작동하며 (기능 제한 없음) 무제한으로 사용할 수 있다(사용일수 제한 없음).

source: Freeware software licenses usually impose restrictions in relation to copying, distributing, and making derivative works of the software, as well as restrictions on the type of usage (personal, commercial, academic, etc.)
ko: 프리웨어 소프트웨어 라이선스는 일반적으로 사용 유형 (개인, 상업, 학문 등)에 대한 제한 뿐만 아니라 소프트웨어의 복제, 배포 및 파생 저작물 제작과 관련하여 제한을 부과한다.

source: Freeware – software distributed under a proprietary license at no or very low cost
ko: 프리웨어 – 독점 라이선스 하에서 무료 또는 매우 저렴한 비용으로 배포되는 소프트웨어

source: Fulfillment of license obligations when product ships
ko: 제품 배송시 라이선스 의무 이행

source: GPL-2.0 and EPL-1.0 each extend their obligations to “derivative works” which are distributed.
ko: GPL2.0과 EPL1.0은 배포되는 “2차적 저작물”에 자신의 의무를 확대한다.

source: GPL-2.0 project also includes code under BSD-3-Clause
ko: GPL-2.0 프로젝트가 또한 BSD-3-Clause하의 코드를 포함합니다.

source: Gather and retain FOSS project information required for your FOSS review process
ko: FOSS 리뷰 프로세스에서 요구되는 FOSS 프로젝트 정보를 수집하고 유지한다.

source: Gather relevant information
ko: 관련 정보 수집

source: General guidelines developers can practices when working with FOSS:
ko: FOSS로 작업을 할 때 개발자가 사용할 수 있는 일반적인 가이드라인:

source: Geographical scope
ko: 지리적 범위

source: Germany is one example.
ko: 독일이 하나의 예입니다.

source: Give an example of a compliance process failure.
ko: 컴플라이언스 프로세스의 실패 사례를 제시하시오.

source: Give an example of a license compliance failure.
ko: 라이선스 컴플라이언스의 실패 사례를 제시하시오.

source: Give an example of an intellectual property failure.
ko: 지식 재산권의 실패 사례를 제시하시오.

source: Good relationships with the software communities may also be helpful for two-way communication: upstreaming improvements and getting support from the software developers.
ko: 소프트웨어 커뮤니티와의 좋은 관계는 양방향 커뮤니케이션에 도움이 될 수 있다: 업스트림 개선 및 소프트웨어 개발자로부터의 지원

source: Guidance
ko: 가이드

source: Hardware
ko: 하드웨어

source: Have training on the organization’s FOSS policy available to everyone
ko: 조직의 FOSS 정책에 대한 교육을 모든 사람이 받을 수 있게 함.

source: How can a new version of a previously-reviewed FOSS component create new compliance issues?
ko: 이전에 리뷰된 FOSS 컴포넌트의 새로운 버전이 어떻게 새로운 컴플라이언스 이슈를 야기할 수 있는가?

source: How can they raise questions about FOSS usage?
ko: FOSS 사용에 대해 어떻게 질문 할 수 있습니까?

source: How do you want to use a FOSS component?
ko: FOSS 컴포넌트를 어떻게 사용하길 원하는가?

source: How is the FOSS component distributed?
ko: FOSS 컴포넌트가 어떻게 배포되는가?

source: However, patent protects functionality, and not abstract ideas.
ko: 그러나 특허는 추상적인 아이디어가 아니라 기능을 보호합니다.

source: However, the amount of information required depends on the size of your company and what you intend to do with the FOSS code.
ko: 그러나 필요한 정보의 양은 회사의 규모와 FOSS 코드로 하려는 의도에 따라 달라집니다.

source: Identification
ko: 식별

source: Identification - Identify and track FOSS usage. This may take place through engineer requests, third party disclosures, or code scanning.
ko: 식별 - FOSS 사용을 식별하고 추적합니다. 이는 엔지니어 요청, 제3자 정보 공개 또는 코드 스캐닝을 통해 발생할 수 있습니다.

source: Identification of the origin and license of FOSS software
ko: FOSS 소프트웨어의 출처 및 라이선스 식별

source: Identification of the origin and license of all internal and external software
ko: 모든 내,외부 소프트웨어의 출처와 라이선스 식별

source: Identify FOSS components
ko: FOSS 컴포넌트 식별

source: Identify FOSS components for review
ko: 리뷰를 위해 FOSS 컴포넌트 식별

source: Identify FOSS licenses
ko: FOSS 라이선스 식별

source: Identify and Track FOSS Usage
ko: FOSS 사용의 확인 및 추적

source: Identify and audit FOSS licenses
ko: FOSS 라이선스 식별 및 검사

source: Identifying all the FOSS components used in Supplied Software
ko: 공급 대상 소프트웨어에 사용된 모든 FOSS 컴포넌트 식별

source: Identifying and tracking all obligations created by those components
ko: 해당 컴포넌트에 의해 발생된 모든 의무를 식별하고 추적

source: If a FOSS project’s license changes, ensure that compliance records are updated and that the new license does not create a conflict
ko: FOSS 프로젝트의 라이선스가 변경되었다면, 컴플라이언스 기록을 업데이트하고 새로운 라이선스가 충돌을 일으키는지 확인한다.

source: If a GPL-2.0 module is combined with an EPL-1.0 module and the merged module is distributed, that module must
ko: GPL-2.0 모듈이 EPL-1.0 모듈과 결합되어 통합된 모듈이 배포될 경우, 그 모듈은 반드시

source: If from an external vendor:
ko: 외부 공급 업체로부터 입수한 경우:

source: If one license requires you to do something and another prohibits doing that, the licenses conflict and are not compatible if the combination of the two software modules trigger the obligations under a license.
ko: 어느 라이선스가 귀하에게 무엇을 행할 것을 요구하고 다른 라이선스는 그를 금지할 경우 그 라이선스들은 충돌하고, 두 소프트웨어 모듈의 결합이 어느 하나의 라이선스의 의무를 발생시키는 경우 양립가능하지 않다.

source: If required by a FOSS license, appropriate notices should be prepared (often in a text file that accompanies the release).
ko: FOSS 라이선스에 의해 요구가 된다면, 적절한 고지가 준비되어야 합니다. (주로 텍스트 파일을 출시와 함께 제공)

source: If they choose the license you weren’t going to use, now you might have to consider if you should figure out who the original © holder is and get the code directly from them
ko: 그들이 선택한 라이선스가 당신이 사용하지 않을 라이선스라면, 귀하는 누가 원 저작권자인지 알아내서 그들로부터 직접 코드를 받아오는 것을 고려해야합니다.

source: If you have independently developed your own software, then you may not need a copyright license if you can show the independent development and you had no access to the copyrighted work in question.
ko: 자신의 소프트웨어를 독자적으로 개발한 경우 자체 개발하였음을 보여줄 수 있고 문제의 저작권으로 보호 된 저작물에 대해 접근하지 않았다면 저작권 라이선스가 필요하지 않을 수 있습니다.

source: If you independently develop your own software, is it possible that you might need a copyright license from a third party for that software? A patent license?
ko: 자신의 소프트웨어를 독자적으로 개발하는 경우, 해당 소프트웨어에 대한 제3자의 저작권 라이선스가 필요할 수 있는가? 특허 라이선스가 필요할 수 있는가?

source: Implementing Compliance Practices
ko: 컴플라이언스 실무 실행

source: Important questions to ask include:
ko: 중요한 질문은 다음과 같습니다:

source: Important steps in a compliance process:
ko: 컴플라이언스 프로세스의 중요 단계:

source: In addition, good relationships with FOSS organizations can be very helpful in advising on best way to be compliant and also help out if you experience a compliance issue.
ko: 또한 FOSS 기관과의 좋은 관계는 컴플라이언스에 대한 최선의 방법에 대해 조언을 받을때 매우 유용할 수 있으며, 컴플라이언스 이슈가 발생할 경우에도 도움이 된다.

source: In cases where source code must be made available, the company provides the accompanying source code through the mechanisms permitted under the FOSS license.
ko: 소스 코드를 제공해야 하는 경우, 회사는 FOSS 라이선스에서 허용하는 매커니즘을 통해 동반하는 소스 코드를 제공합니다.

source: In cases where source code must be made available, the company verifies that the source code matches the binary files being distributed.
ko: 소스 코드를 제공해야 하는 경우, 회사는 소스 코드가 배포되는 바이너리 파일과 일치하는지 확인합니다.

source: In each case, the failures may be prevented by properly applying steps in the compliance process.
ko: 각각의 경우, 컴플라이언스 프로세스의 단계를 적절하게 적용함으로 실패를 방지할 수 있습니다.

source: In general it refers to a new work based upon an original work to which enough original creative work has been added so that the new work represents an original work of authorship rather than a copy
ko: 일반적으로 충분한 저작 활동이 추가된 독창적인 저작물을 기반으로 한 새로운 저작물을 말하며, 이는 새로운 저작물의 사본이 아닌 원본 저작물을 나타내는 것이다.

source: In our example, the company may conduct research into the identified FOSS component (e.g., review declared licenses, research origins of the FOSS component).
ko: 이 예에서 회사는 식별된 FOSS 컴포넌트에 댛나 연구를 수행할 수 있습니다.(예: 선언된 라이선스 리뷰, FOSS 컴포넌트의 출처 연구)

source: In that case, you are free to choose the license that suits your need.
ko: 이 경우, 귀하는 귀하의 필요에 맞는 라이선스를 자유롭게 선택할 수 있습니다.

source: In the US public domain software can be included in FOSS code, but it should be noted that not all legal jurisdictions recognize the existence or permit the release of authorship under public domain.
ko: 미국에서 퍼블릭 도메인 소프트웨어는 FOSS 코드에 포함될 수 있지만, 모든 법적 관할권이 퍼블릭 도메인 하에서 저작물의 공개를 인정하거나 허용하지는 않습니다.

source: In the approval step of our example process, the review team communicates whether it approves of the FOSS usage in question, along with any associated conditions or obligations.
ko: 예제 프로세스의 승인 단계에서, 리뷰팀은 문제가 되는 FOSS에 대해 관련 조건 또는 의무에 따라 사용을 승인할지 여부에 대해 전달합니다.

source: In the first case, a code base may be used in development and releases without proper review.
ko: 첫번째 경우는 코드 베이스가 적절한 검토 없이 개발 및 출시에 사용된 것입니다.

source: In the last case, the compliance process may face release deadline pressures and have limited time to perform its tasks.
ko: 마지막 경우, 컴플라이언스 프로세스는 출시 기한 압박에 직면할 수 있으며 작업을 수행하는데 시간이 제한될 수 있습니다.

source: In the previous step we removed FOSS usage that did not conform to company policy.
ko: 이전 단계에서 회사 정책을 준수하지 않은 FOSS 사용을 제거했습니다.

source: In the second case, FOSS usage may be known, but license obligations are not reviewed or determined.
ko: 두번째 경우는 FOSS 사용은 알았지만, 라이선스 의무가 검토되거나 밝혀지지 않았습니다.

source: In these cases, the engineering team does not raise FOSS usage to the review process, or does not receive the training on how to handle FOSS usage.
ko: 이러한 경우, 엔지니어링팀은 FOSS 사용에 대해 리뷰 프로세스를 제기하지 않거나, FOSS 사용을 처리하는 방업에 대한 교육을 받지 못하였습니다.

source: In this chapter, we will describe some common pitfalls to avoid in the FOSS compliance process.
ko: 이 장에서는 FOSS 컴플라이언스 프로세스에서 피할 수 있는 몇가지 일반적인 함정들을 설명합니다.

source: In this example, the FOSS review team may identify FOSS usage through review requests from engineers, from performing scans of internally-developed and third-party software, or reviewing code checked into development branches.
ko: 이 예에서 FOSS 리뷰팀은 엔지니어의 리뷰 요청, 내부 개발 및 제3자 소프트웨어의 스캔 수행 또는 개발 브랜치에 추가된 코드의 리뷰를 통해 FOSS 사용을 식별할 수 있습니다.

source: In this situation you have to comply with both sets of license terms
ko: 이 경우, 두가지 라이선스 조항을 모두 준수해야 합니다.

source: In this slide of our example process, the company verifies that it has met its FOSS license obligations before release.
ko: 이 예제 프로세스의 슬라이드에서, 회사는 출시 전에 FOSS 라이선스 의무를 충족했는지 확인합니다.

source: In this step, the FOSS review team reviews the facts collected in the previous steps and identifies the company’s obligations under the FOSS licenses.
ko: 이 단계에서 FOSS 리뷰팀은 이전 단계에서 수집된 사실을 리뷰하고 FOSS 라이선스에 의한 회사의 의무를 식별합니다.

source: In this step, the company verifies that its distribution complies with its FOSS license obligations.
ko: 이 단계에서 회사는 배포가 FOSS 라이선스 의무를 준수하는지 확인합니다.

source: In this step, we evaluate and identify the license obligations for FOSS usage that is retained.
ko: 이 단계에서 FOSS 사용에 대한 라이선스 의무를 평가하고 식별합니다.

source: In-bound software
ko: 유입된 소프트웨어

source: Include appropriate authority levels in review staff
ko: 리뷰 직원에게 적절한 수준의 권한을 부여한다.

source: Include time required to follow established FOSS policy in work plans
ko: 작업 계획에 수립된 FOSS 정책을 준수하는데 필요한 시간을 포함시킨다.

source: Includes Binary Code and Source Code
ko: 바이너리 코드 및 소스 코드 포함한다.

source: Including compliance in the employees performance review
ko: 직원 성과 리뷰에 컴플라이언스를 포함한다.

source: Inclusion of proprietary code into copyleft FOSS through source code modifications
ko: 소스 코드 수정을 통해 독점 코드를 Copyleft FOSS에 포함

source: Incoming
ko: 유입

source: Incoming requests from engineering
ko: 엔지니어링으로부터 요청 접수

source: Incoming:
ko: 유입:

source: Incorporation
ko: 편입

source: Incorporation is when you copy portions of a FOSS component into your software product.
ko: 결합은 FOSS 컴포넌트의 일부를 소프트웨어 제품에 복사하는 것입니다.

source: Increased knowledge of available FOSS solutions
ko: 이용 가능한 FOSS 해결에 대한 지식 증가

source: Increased understanding of the benefits of FOSS and how it impacts your organization
ko: FOSS의 혜택과 그것이 조직에 미치는 영향에 대한 이해 증가

source: Increased understanding of the costs and risks associated with using FOSS
ko: FOSS 사용과 관련된 비용과 위험에 대한 이해 증가

source: Inform the end user of the product on how to obtain a copy of the FOSS source code (when applicable, for example in the case of GPL and LGPL)
ko: FOSS 소스 코드의 사본을 얻는 방법에 대해 제품의 최종 사용자에게 알린다(해당하는 경우. 예: GPL 및 LGPL).

source: Infringement may occur even if other parties independently create the same invention
ko: 다른 당사자가 독자적으로 동일한 발명을 창작하더라도 침해가 발생할 수 있다.

source: Infringement may occur if copying without the permission of the author
ko: 저자의 허락없이 복사하는 경우 저작권 침해가 발생할 수 있다.

source: Initiate a FOSS Review
ko: FOSS 리뷰를 시작하시오

source: Initiate a FOSS review process or contact the FOSS review team.
ko: FOSS 리뷰 프로세스를 시작하거나 FOSS 리뷰팀에 문의하십시오.

source: Initiate a FOSS review process.
ko: FOSS 리뷰 프로세스를 시작합니다.

source: Initiating a FOSS Review
ko: FOSS 리뷰 시작하기

source: Inject material
ko: 자료 주입

source: Injecting
ko: 주입 (Injecting)

source: Inserting
ko: 삽입 (Inserting)

source: Integrating
ko: 통합 (Integrating)

source: Intellectual Property (IP) pitfalls
ko: 지식 재산권 (IP) 함정

source: Intellectual Property Pitfalls
ko: 지식 재산권 함정

source: Intended use in your product
ko: 제품 내 의도된 용도

source: Introduction
ko: 소개

source: Introduction to FOSS Compliance
ko: FOSS 컴플라이언스 소개

source: Introduction to FOSS Licenses
ko: FOSS 라이선스 소개

source: Is the code and associated information complete, consistent and accurate?
ko: 코드 및 관련 정보가 완전하고 일관되며 정확한 것인가?

source: Is there a regular point in your development process where FOSS Reviews can begin?
ko: 개발 프로세스에 FOSS 리뷰가 시작될 수 있는 정규 지점이 있습니까?

source: Issues that need resolving
ko: 해결이 필요한 문제

source: It also explains a resource where you can find out more about some FOSS licenses.
ko: 또한 FOSS 라이선스에 대해 어디서 자세한 정보를 얻을 수 있는지에 대한 리소스를 설명합니다.

source: It can help you more effectively use FOSS in your development process, and also help maintain good working relationships within the FOSS community.
ko: 그것이 개발 프로세스에서 FOSS를 보다 효과적으로 사용할 수 있도록 하고, FOSS 커뮤니티 내에서 좋은 협력 관계를 유지하는데 도움을 줍니다.

source: It covers software, books, and similar works
ko: 소프트웨어, 서적 및 이와 유사한 저작물을 다룬다.

source: It explains a little bit about derivative works.
ko: 2차적 저작물에 대해 약간 설명합니다.

source: It explains how compliance works from first principles.
ko: 컴플라이언스가 첫번째 원칙에서부터 어떻게 작동하는지 설명합니다.

source: It involves understanding the licenses, having processes to support the license terms, and having processes to address any oversights or errors.
ko: 여기에는 라이선스를 이해하고, 라이선스 조항을 지원하는 프로세스가 있으며, 과실이나 오류를 처리하는 프로세스를 갖는 것을 포함합니다.
